# Лабораторная работа №3

**Тема:** Пароль

**Цель работы:** Исследование влияния длины пароля на скорость его подбора методом полного перебора с использованием библиотеки `timeit` на языке Python.

## Задание

1. Пользователь задает пароль известной длины \( n \), используя латинский алфавит.
2. Написать программу, которая методом полного перебора отгадает пароль.
3. С помощью библиотеки `timeit` изучить, как размер \( n \) влияет на скорость подбора пароля.
4. Используя таблицу символов ASCII и метод полного перебора, определить, какой пароль будет самым безопасным и самым небезопасным для длины 5, 10 и 15 символов.
5. Сравнить скорость нахождения пароля для этих случаев.

## Реализация

### Программа на Python

```python
import timeit
import itertools
import string

def brute_force_password(target):
    chars = string.ascii_lowercase
    attempts = 0
    for length in range(1, len(target) + 1):
        for guess in itertools.product(chars, repeat=length):
            attempts += 1
            guess = ''.join(guess)
            if guess == target:
                return attempts

def measure_time(target):
    return timeit.timeit(lambda: brute_force_password(target), number=1)

passwords = {
    5: "aaaaa",
    10: "aaaaaaaaaa",
    15: "aaaaaaaaaaaaaaa"
}

for length, password in passwords.items():
    time_taken = measure_time(password)
    print(f"Время подбора пароля длиной {length} символов: {time_taken:.4f} секунд")

def analyze_security(length):
    chars = string.ascii_letters + string.digits + string.punctuation
    least_secure_password = 'a' * length
    most_secure_password = ''.join(itertools.islice(itertools.cycle(chars), length))
    
    time_least_secure = measure_time(least_secure_password)
    time_most_secure = measure_time(most_secure_password)
    
    return (least_secure_password, time_least_secure), (most_secure_password, time_most_secure)

for length in [5, 10, 15]:
    (least_secure, time_least), (most_secure, time_most) = analyze_security(length)
    print(f"\nДлина пароля: {length}")
    print(f"Наименее безопасный пароль: {least_secure}, время подбора: {time_least:.4f} секунд")
    print(f"Наиболее безопасный пароль: {most_secure}, время подбора: {time_most:.4f} секунд")
```

## Объяснение работы программы

1. **Функция `brute_force_password`**: генерирует все возможные пароли заданной длины с использованием латинского алфавита и сравнивает их с заданным паролем.
2. **Функция `measure_time`**: измеряет время подбора пароля с использованием библиотеки `timeit`.
3. **Пароли для тестирования**: создаются пароли длиной 5, 10 и 15 символов, и измеряется время их подбора.
4. **Анализ безопасности паролей**: определяет наименее и наиболее безопасные пароли для заданной длины и сравнивает время их подбора.

## Результаты

### Время подбора паролей длиной 5, 10 и 15 символов

```
Время подбора пароля длиной 5 символов: 0.0259 секунд
Время подбора пароля длиной 10 символов: n/a
Время подбора пароля длиной 15 символов: n/a
```

Так как подбор пароля длиной 10 и 15 символов занимает слишком много времени, то результаты не были получены.
Было решено посчитать время подбора пароля длиной 10 и 15 символов вручную на основе данных по 5 символам.

Предположим, что все пароли состоят только из строчных латинских букв, то есть у нас 26 возможных символов. Количество возможных комбинаций для пароля длиной `n` символов будет равно \( 26^n \).

Для оценки используем следующие данные:
- Пароль длиной 5 символов: \( 26^5 \) комбинаций.
- Пароль длиной 10 символов: \( 26^{10} \) комбинаций.
- Пароль длиной 15 символов: \( 26^{15} \) комбинаций.

### Время подбора пароля длиной 5 символов

Время подбора для 5-символьного пароля (из замеров): 0.0259 секунды.

### Экстраполяция для пароля длиной 15 символов

Чтобы оценить время подбора пароля длиной 15 символов, можем воспользоваться следующей формулой:

Время для n символов = Время для m символов * ( 26^n / 26^m)

Используем данные для пароля длиной 5 символов для расчета времени для 10 символов:

Время для 10 символов = Время для 5 символов * ( 26^10 / 26^5)

Время для 10 символов = 0.0259 * 26^5

26^5 = 11,881,376
Время для 10 символов = 307728 секунд (примерно 3.5 дня)

Теперь используем данные для пароля длиной 10 символов для расчета времени для 15 символов:

Время для 15 символов = 307728 * 26^5

Время для 15 символов = 3656232073728 секунд (примерно 115938 лет)

### Анализ безопасности паролей

```
Длина пароля: 5
Наименее безопасный пароль: aaaaa, время подбора: 0.0259 секунд
Наиболее безопасный пароль: abcde, время подбора: 0.0223 секунд
```

## Заключение

В ходе выполнения лабораторной работы были изучены методы подбора пароля методом полного перебора и проанализировано влияние длины пароля на скорость его подбора. Результаты показывают, что даже небольшое увеличение длины пароля значительно увеличивает время его подбора, что подчеркивает важность использования длинных и сложных паролей для обеспечения безопасности.